[
  {
    "path": "posts/2021-06-22-blogtest/",
    "title": "Test of a blog type of post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Vincent Bagilet",
        "url": {}
      }
    ],
    "date": "2021-06-23",
    "categories": [
      "Test",
      "R"
    ],
    "contents": "\nDistill is a publication format for scientific and technical writing, native to the web.\nLearn more about using Distill at https://rstudio.github.io/distill.\n\n\n\n\n\n\n\n\n\n\n\n",
    "preview": "posts/2021-06-22-blogtest/mountain.png",
    "last_modified": "2021-06-23T11:44:12+02:00",
    "input_file": {},
    "preview_width": 1280,
    "preview_height": 853
  },
  {
    "path": "posts/2021-06-22-mediocrethemes/",
    "title": "mediocrethemes",
    "description": "I created a small package providing not particularly nice and, hopefully, not particularly ugly ggplot themes. Setting the theme for all graphs in a document only requires one short line of code.",
    "author": [
      {
        "name": "Vincent Bagilet",
        "url": {
          "https://vincentbagilet.github.io/vincentbagilet_website": {}
        }
      }
    ],
    "date": "2021-06-22",
    "categories": [
      "R",
      "Data viz",
      "ggplot"
    ],
    "contents": "\nI created a small package providing a ready to use ggplot themes, mediocrethemes. The resulting themes are, in my opinion, not strikingly nice but, hopefully, not strikingly ugly either, hence why the name of the package. More info and vignettes to get familiar with the package can be found on the package website.\nTo me, the most useful feature of my package is the function, set_mediocre_all(). When called at the beginning of the code, all subsequent graphs will be created using the new theme, without any additional line of code. This enables users to depart very easily from the nice but too often seen base ggplot themes and color schemes.\nI also tried to build my code so that it is reproducible. Users should be able to adapt it to create their own theme if they want to. The code for this package can be find on GitHub.\nThe base color palette is:\n\n\n\nHere are a couple of example plots of the theme and main color scale used but much more can be seen on the package website.\n\n\n\n\n\n\n",
    "preview": "posts/2021-06-22-mediocrethemes/mediocrethemes_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-06-23T11:44:08+02:00",
    "input_file": {},
    "preview_width": 3900,
    "preview_height": 2400
  }
]
